#main

w = int(input("width = ")) # รับค่าจากผู้ใช้
h = int(input("heing = ")) # รับค่าจากผู้ใช้
print("1.rectangle")# แสดงค่าที่รับมา
print("2.triangle คำนวณ ")# แสดงค่าที่รับมา
print("3.circle")# แสดงค่าที่รับมา
n = input("ple : ")
if n == "1": # ถ้าค่าที่รับมาเท่ากับ 1
    print("ความกว้าง = ",w,"ความสูง = ",h,"ความละเอียด = ",w*h)
elif n == "2":# ถ้าค่าที่รับมาเท่ากับ 2
    print("ความกว้าง = ",w,"ความสูง = ",h,"ความละเอียด = ",w*h/2)
elif n == "3":# ถ้าค่าที่รับมาเท่ากับ 3
    print("ความกว้าง = ",w,"ความสูง = ",h,"ความละเอียด = ",w*h/3)
else:# ถ้าค่าที่รับมาเท่ากับ 4
    print("คำนวณไม่ถูกต้อง")
